10/data/attachments/1c6019aab353b7f7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_2a4c577d-82d0-4656-b44f-1447e3bd2087</nif:username>
            <nif:friendToBeAdded>Jennifer_with_Actions_21036_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>